MikroElektronika/core_packages/dsPIC/XC16/def/dsPIC33EV256GM104/mcu.h
extern volatile RPINR38BITS RPINR38bits __attribute__((__sfr__));

#define RPINR39 RPINR39
extern volatile uint16_t RPINR39 __attribute__((__sfr__));
__extension__ typedef struct tagRPINR39BITS {
  union {
    struct {
      uint16_t DTCMP2R:8;
      uint16_t DTCMP3R:8;
    };
    struct {
      uint16_t DTCMP2R0:1;
      uint16_t DTCMP2R1:1;
      uint16_t DTCMP2R2:1;
      uint16_t DTCMP2R3:1;
      uint16_t DTCMP2R4:1;
      uint16_t DTCMP2R5:1;
      uint16_t DTCMP2R6:1;
      uint16_t DTCMP2R7:1;
      uint16_t DTCMP3R0:1;
      uint16_t DTCMP3R1:1;
      uint16_t DTCMP3R2:1;
      uint16_t DTCMP3R3:1;
      uint16_t DTCMP3R4:1;
      uint16_t DTCMP3R5:1;
      uint16_t DTCMP3R6:1;
      uint16_t DTCMP3R7:1;
    };
  };
} RPINR39BITS;
extern volatile RPINR39BITS RPINR39bits __attribute__((__sfr__));

#define RPINR44 RPINR44
extern volatile uint16_t RPINR44 __attribute__((__sfr__));
__extension__ typedef struct tagRPINR44BITS {
  union {
    struct {
      uint16_t :8;
      uint16_t SENT1R:8;
    };
    struct {
      uint16_t :8;
      uint16_t SENT1R0:1;
      uint16_t SENT1R1:1;
      uint16_t SENT1R2:1;
      uint16_t SENT1R3:1;
      uint16_t SENT1R4:1;
      uint16_t SENT1R5:1;
      uint16_t SENT1R6:1;
      uint16_t SENT1R7:1;
    };
  };
} RPINR44BITS;
extern volatile RPINR44BITS RPINR44bits __attribute__((__sfr__));

#define RPINR45 RPINR45
extern volatile uint16_t RPINR45 __attribute__((__sfr__));
__extension__ typedef struct tagRPINR45BITS {
  union {
    struct {
      uint16_t SENT2R:8;
    };
    struct {
      uint16_t SENT2R0:1;
      uint16_t SENT2R1:1;
      uint16_t SENT2R2:1;
      uint16_t SENT2R3:1;
      uint16_t SENT2R4:1;
      uint16_t SENT2R5:1;
      uint16_t SENT2R6:1;
      uint16_t SENT2R7:1;
    };
  };
} RPINR45BITS;
extern volatile RPINR45BITS RPINR45bits __attribute__((__sfr__));

#define DMTCON DMTCON
extern volatile uint16_t DMTCON __attribute__((__sfr__));
typedef struct tagDMTCONBITS {
  uint16_t :15;
  uint16_t ON:1;
} DMTCONBITS;
extern volatile DMTCONBITS DMTCONbits __attribute__((__sfr__));

#define DMTPRECLR DMTPRECLR
extern volatile uint16_t DMTPRECLR __attribute__((__sfr__));
typedef struct tagDMTPRECLRBITS {
  uint16_t :8;
  uint16_t STEP1:8;
} DMTPRECLRBITS;
extern volatile DMTPRECLRBITS DMTPRECLRbits __attribute__((__sfr__));

#define DMTCLR DMTCLR
extern volatile uint16_t DMTCLR __attribute__((__sfr__));
typedef struct tagDMTCLRBITS {
  uint16_t STEP2:8;
} DMTCLRBITS;
extern volatile DMTCLRBITS DMTCLRbits __attribute__((__sfr__));

#define DMTSTAT DMTSTAT
extern volatile uint16_t DMTSTAT __attribute__((__sfr__));
typedef struct tagDMTSTATBITS {
  uint16_t WINOPN:1;
  uint16_t :4;
  uint16_t DMTEVENT:1;
  uint16_t BAD2:1;
  uint16_t BAD1:1;
} DMTSTATBITS;
extern volatile DMTSTATBITS DMTSTATbits __attribute__((__sfr__));

#define DMTCNTL DMTCNTL
extern volatile uint16_t DMTCNTL __attribute__((__sfr__));
#define DMTCNTH DMTCNTH
extern volatile uint16_t DMTCNTH __attribute__((__sfr__));
#define DMTHOLDREG DMTHOLDREG
extern volatile uint16_t DMTHOLDREG __attribute__((__sfr__));
#define DMTPSCNTL DMTPSCNTL
extern volatile uint16_t DMTPSCNTL __attribute__((__sfr__));
#define DMTPSCNTH DMTPSCNTH
extern volatile uint16_t DMTPSCNTH __attribute__((__sfr__));
#define DMTPSINTVL DMTPSINTVL
extern volatile uint16_t DMTPSINTVL __attribute__((__sfr__));
#define DMTPSINTVH DMTPSINTVH
extern volatile uint16_t DMTPSINTVH __attribute__((__sfr__));
#define NVMCON NVMCON
extern volatile uint16_t NVMCON __attribute__((__sfr__));
__extension__ typedef struct tagNVMCONBITS {
  union {
    struct {
      uint16_t NVMOP:4;
      uint16_t :4;
      uint16_t URERR:1;
      uint16_t RPDF:1;
      uint16_t :2;
      uint16_t NVMSIDL:1;
      uint16_t WRERR:1;
      uint16_t WREN:1;
      uint16_t WR:1;
    };
    struct {
      uint16_t NVMOP0:1;
      uint16_t NVMOP1:1;
      uint16_t NVMOP2:1;
      uint16_t NVMOP3:1;
    };
  };
} NVMCONBITS;
extern volatile NVMCONBITS NVMCONbits __attribute__((__sfr__));

#define NVMADR NVMADR
extern volatile uint16_t NVMADR __attribute__((__sfr__));
#define NVMADRU NVMADRU
extern volatile uint16_t NVMADRU __attribute__((__sfr__));
typedef struct tagNVMADRUBITS {
  uint16_t NVMADRU:8;
} NVMADRUBITS;
extern volatile NVMADRUBITS NVMADRUbits __attribute__((__sfr__));

#define NVMKEY NVMKEY
extern volatile uint16_t NVMKEY __attribute__((__sfr__));
#define NVMSRCADRL NVMSRCADRL
extern volatile uint16_t NVMSRCADRL __attribute__((__sfr__));
#define NVMSRCADRH NVMSRCADRH
extern volatile uint16_t NVMSRCADRH __attribute__((__sfr__));
typedef struct tagNVMSRCADRHBITS {
  uint16_t NVMSRCADRH:8;
} NVMSRCADRHBITS;
extern volatile NVMSRCADRHBITS NVMSRCADRHbits __attribute__((__sfr__));

#define RCON RCON
extern volatile uint16_t RCON __attribute__((__sfr__));
typedef struct tagRCONBITS {
  uint16_t POR:1;
  uint16_t BOR:1;
  uint16_t IDLE:1;
  uint16_t SLEEP:1;
  uint16_t WDTO:1;
  uint16_t SWDTEN:1;
  uint16_t SWR:1;
  uint16_t EXTR:1;
  uint16_t VREGS:1;
  uint16_t CM:1;
  uint16_t :1;
  uint16_t VREGSF:1;
  uint16_t :2;
  uint16_t IOPUWR:1;
  uint16_t TRAPR:1;
} RCONBITS;
extern volatile RCONBITS RCONbits __attribute__((__sfr__));

#define OSCCON OSCCON
extern volatile uint16_t OSCCON __attribute__((__sfr__));
__extension__ typedef struct tagOSCCONBITS {
  union {
    struct {
      uint16_t OSWEN:1;
      uint16_t :2;
      uint16_t CF:1;
      uint16_t :1;
      uint16_t LOCK:1;
      uint16_t IOLOCK:1;
      uint16_t CLKLOCK:1;
      uint16_t NOSC:3;
      uint16_t :1;
      uint16_t COSC:3;
    };
    struct {
      uint16_t :8;
      uint16_t NOSC0:1;
      uint16_t NOSC1:1;
      uint16_t NOSC2:1;
      uint16_t :1;
      uint16_t COSC0:1;
      uint16_t COSC1:1;
      uint16_t COSC2:1;
    };
  };
} OSCCONBITS;
extern volatile OSCCONBITS OSCCONbits __attribute__((__sfr__));

#define OSCCONL OSCCONL
extern volatile uint8_t OSCCONL __attribute__((__sfr__));
#define OSCCONH OSCCONH
extern volatile uint8_t OSCCONH __attribute__((__sfr__));
#define CLKDIV CLKDIV
extern volatile uint16_t CLKDIV __attribute__((__sfr__));
__extension__ typedef struct tagCLKDIVBITS {
  union {
    struct {
      uint16_t PLLPRE:5;
      uint16_t :1;
      uint16_t PLLPOST:2;
      uint16_t FRCDIV:3;
      uint16_t DOZEN:1;
      uint16_t DOZE:3;
      uint16_t ROI:1;
    };
    struct {
      uint16_t PLLPRE0:1;
      uint16_t PLLPRE1:1;
      uint16_t PLLPRE2:1;
      uint16_t PLLPRE3:1;
      uint16_t PLLPRE4:1;
      uint16_t :1;
      uint16_t PLLPOST0:1;
      uint16_t PLLPOST1:1;
      uint16_t FRCDIV0:1;
      uint16_t FRCDIV1:1;
      uint16_t FRCDIV2:1;
      uint16_t :1;
      uint16_t DOZE0:1;
      uint16_t DOZE1:1;
      uint16_t DOZE2:1;
    };
  };
} CLKDIVBITS;
extern volatile CLKDIVBITS CLKDIVbits __attribute__((__sfr__));

#define PLLFBD PLLFBD
extern volatile uint16_t PLLFBD __attribute__((__sfr__));
__extension__ typedef struct tagPLLFBDBITS {
  union {
    struct {
      uint16_t PLLDIV:9;
    };
    struct {
      uint16_t PLLDIV0:1;
      uint16_t PLLDIV1:1;
      uint16_t PLLDIV2:1;
      uint16_t PLLDIV3:1;
      uint16_t PLLDIV4:1;
      uint16_t PLLDIV5:1;
      uint16_t PLLDIV6:1;
      uint16_t PLLDIV7:1;
      uint16_t PLLDIV8:1;
    };
  };
} PLLFBDBITS;
